# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, MetaNeXtStage, [64, 1,3]]
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, MetaNeXtStage, [128, 1,6]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, MetaNeXtStage, [256, 1,6]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, MetaNeXtStage, [512, 1,6]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, MetaNeXtStage, [1024, 1,3]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]] # 11
 
# YOLO11n head
head:
  - [ 3, 1, Conv, [ 128, 1, 1 ] ] #12
  - [ 5, 1, Conv, [ 256, 1, 1 ] ] #13
  - [ 7, 1, Conv, [ 512, 1, 1 ] ] #14
  - [ [ 12, 13, 14 ], 1, ASFF_3, [ 128, 0 ] ] #15
  - [ [ 12, 13, 14 ], 1, ASFF_3, [ 256, 1 ] ] #16
  - [ [ 12, 13, 14 ], 1, ASFF_3, [ 512, 2 ] ] #17
  - [-3, 3, C3k2, [128, True]]  # 18
  - [-3, 3, C3k2, [256, True]]  # 19
  - [-3, 3, C3k2, [512, True]]  # 20
  - [ 11, 1, Conv, [ 1024, 1, 1 ] ] #21

  - [ [ 18, 19, 20, 21 ], 1, ASFF_4, [ 128, 0 ] ] #22
  - [ [ 18, 19, 20, 21 ], 1, ASFF_4, [ 256, 1 ] ] #23
  - [ [ 18, 19, 20, 21 ], 1, ASFF_4, [ 512, 2 ] ] #24
  - [ [ 18, 19, 20, 21 ], 1, ASFF_4, [ 1024, 3 ] ] #25

  - [ 22, 3, C3k2, [ 128, True ] ]  # 26
  - [ 23, 3, C3k2, [ 256, True ] ]  # 27
  - [ 24, 3, C3k2, [ 512, True ] ]  # 28
  - [ 25, 3, C3k2, [ 1024, True ] ]  # 29

  - [ 26, 1, Conv, [ 512, 1, 1 ] ] #30
  - [ 27, 1, Conv, [ 512, 1, 1 ] ] #31
  - [ 28, 1, Conv, [ 512, 1, 1 ] ] #32
  - [ 29, 1, Conv, [ 512, 1, 1 ] ] #33

  - [[30, 31, 32, 33], 1, Detect_dyhead, [nc]] # Detect(P2, P3, P4, P5)

